function [output] = f_GetColorMoment(X)
    R = X(:,:,1);%分别定义R、G、B的颜色矩阵（三维数组，可以用x、y、z轴来说明，每个轴上有三个值。R=X(:,:,1)表示x、y轴取所有情况，即z轴取第一个值时的结果，因此是3*3的二维数组。）
    G = X(:,:,2);
    B = X(:,:,3);
    [m n] = size(R);%将矩阵R的行数返回到第一个输出变量m，将矩阵的列数返回到第二个输出变量n
    N = m*n;                %像素总个数
 %----------------------------------------------------------------------------------------- 
Ur = sum(sum(R)) / N;       %一阶R矩阵：均值(其中一次sum为对矩阵内元素按列求和，两次sum即可对矩阵内全部元素求和)
 R1 = R - Ur;                          %R中每个元素均减Ur
 R2 = R1.*R1;                        %R2= R1^2
 Qr = (sum(sum(R2))/N)^(1/2);  %二阶R矩阵：标准差
  R3 = R1.*R2;                        %R3 = R1^3
  Sr = (sum(sum(R3))/N)^(1/3);    %三阶R矩阵：颜色偏度
%-----------------------------------------------------------------------------------------   
  Ug = sum(sum(G)) / N;    
    R1 = G - Ug;                    
   R2 = R1.*R1;                    
   Qg = (sum(sum(R2))/N)^(1/2);   
   R3 = R1.*R2;                    
   Sg = (sum(sum(R3))/N)^(1/3)
 %----------------------------------------------------------------------------------------- 
  Ub = sum(sum(B)) / N;    
 R1 = G - Ub;                    
 R2 = R1.*R1;                    
 Qb = (sum(sum(R2))/N)^(1/2);   
  R3 = R1.*R2;                    
  Sb = (sum(sum(R3))/N)^(1/3);  
  %-----------------------------------------------------------------------------------------                                             
    output = [Ur Qr Sr Ug Qg Sg Ub Qb Sb];  %输出RGB彩色图像特征向量
end